---
kind: other
id: Properties.T:Autodesk.Revit.DB.BRepBuilderGeometryId
source: html/62899cf4-49e5-fce7-a04e-dbfc612e1793.htm
---
# BRepBuilderGeometryId Properties

Specifies whether the .NET object represents a valid Revit entity.